hw05/submission/23127065/test-plans/23127065_Spike_20260809.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree>
<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="23127065 Spike - Login Search Checkout workflow" enabled="true"><stringProp name="TestPlan.comments">Every iteration runs Login, Product Search, and Checkout. Disabled View Results Tree is retained for debug only.</stringProp><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp></TestPlan><hashTree>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,3000)}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.connect_timeout">2000</stringProp><stringProp name="HTTPSampler.response_timeout">5000</stringProp></ConfigTestElement><hashTree/>
<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Credentials CSV" enabled="true"><stringProp name="delimiter">,</stringProp><stringProp name="filename">${__P(credentials_file,data/auth-credentials.csv)}</stringProp><boolProp name="ignoreFirstLine">false</boolProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">true</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="stopThread">false</boolProp><stringProp name="variableNames"></stringProp></CSVDataSet><hashTree/>
<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Product Search CSV" enabled="true"><stringProp name="delimiter">,</stringProp><stringProp name="filename">${__P(search_file,data/product-searches.csv)}</stringProp><boolProp name="ignoreFirstLine">false</boolProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">true</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="stopThread">false</boolProp><stringProp name="variableNames"></stringProp></CSVDataSet><hashTree/>
<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Checkout Payload CSV" enabled="true"><stringProp name="delimiter">,</stringProp><stringProp name="filename">${__P(checkout_file,data/checkout-payloads.csv)}</stringProp><boolProp name="ignoreFirstLine">false</boolProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">true</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="stopThread">false</boolProp><stringProp name="variableNames"></stringProp></CSVDataSet><hashTree/>
<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON Headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Spike Users" enabled="true"><stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp><stringProp name="ThreadGroup.num_threads">${__P(threads,150)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(ramp,2)}</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${__P(duration,60)}</stringProp><stringProp name="ThreadGroup.delay">0</stringProp></ThreadGroup><hashTree>
<TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Workflow: Login → Search → Checkout" enabled="true"><boolProp name="TransactionController.includeTimers">true</boolProp><boolProp name="TransactionController.parent">true</boolProp></TransactionController><hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Login" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;email&quot;:&quot;${email}&quot;,&quot;password&quot;:&quot;${password}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/login</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy><hashTree>
<ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Login HTTP 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract JWT" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">auth_token</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">TOKEN_NOT_FOUND</stringProp></JSONPostProcessor><hashTree/><JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="JWT extracted and structurally valid" enabled="true"><stringProp name="script">if (vars.get('auth_token') == 'TOKEN_NOT_FOUND' || !vars.get('auth_token').contains('.')) { AssertionResult.setFailure(true) }</stringProp><stringProp name="scriptLanguage">groovy</stringProp></JSR223Assertion><hashTree/><DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Login response under threshold" enabled="true"><stringProp name="DurationAssertion.duration">${__P(max_response_ms,3000)}</stringProp></DurationAssertion><hashTree/></hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Product Search" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="search" elementType="HTTPArgument"><stringProp name="Argument.name">search</stringProp><stringProp name="Argument.value">${search}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/products</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy><hashTree>
<ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Spike think time before search: 50 ms" enabled="true"><stringProp name="ConstantTimer.delay">50</stringProp></ConstantTimer><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Search HTTP 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Expected product fragment" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="fragment">${expected_fragment}</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion><hashTree/><DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Search response under threshold" enabled="true"><stringProp name="DurationAssertion.duration">${__P(max_response_ms,3000)}</stringProp></DurationAssertion><hashTree/></hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Checkout" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;total_amount&quot;:${total_amount},&quot;shipping_address&quot;:&quot;${shipping_address}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/checkout</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy><hashTree>
<ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Spike think time before checkout: 50 ms" enabled="true"><stringProp name="ConstantTimer.delay">50</stringProp></ConstantTimer><hashTree/><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Bearer JWT" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="Authorization" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${auth_token}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Checkout HTTP 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Checkout response contains orderId" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="order">orderId</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion><hashTree/><DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Checkout response under threshold" enabled="true"><stringProp name="DurationAssertion.duration">${__P(max_response_ms,3000)}</stringProp></DurationAssertion><hashTree/></hashTree>
</hashTree></hashTree><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree (debug only)" enabled="false"><boolProp name="ResultCollector.error_logging">false</boolProp><stringProp name="filename"></stringProp></ResultCollector><hashTree/>
</hashTree></hashTree></jmeterTestPlan>